In [24]:
import pandas as pd
from sqlalchemy_utils import create_database
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

In [2]:
df_tmdb_2000 = pd.read_csv('data/final_tmdb_data_2000.csv.gz')
df_tmdb_2001 = pd.read_csv('data/final_tmdb_data_2001.csv.gz')
df_basics = pd.read_csv('data/title_basics.csv.gz')
df_ratings = pd.read_csv('data/title_ratings.csv.gz')

In [3]:
## create a col with a list of genres
df_basics['genres_split'] = df_basics['genres'].str.split(',')
exploded_genres = df_basics.explode('genres_split')
unique_genres = sorted(exploded_genres['genres_split'].unique())
title_genres = exploded_genres[['tconst','genres_split']].copy()

In [4]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [5]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [6]:
genres_lookup = pd.DataFrame({'genre_name':genre_map.keys(),
                              'genre_id':genre_map.values()})

In [7]:
df_basics.drop(columns=['titleType','originalTitle','isAdult','genres','genres_split','endYear'],inplace=True)
df_tmdb = pd.concat([df_tmdb_2000,df_tmdb_2001])
df_tmdb.drop(columns=['adult', 'backdrop_path', 'belongs_to_collection','genres', 'homepage', 'id', 'original_language', 'original_title',
                                'overview', 'popularity', 'poster_path', 'production_companies','spoken_languages', 'status', 'tagline', 'title', 'video',
                                 'vote_average', 'vote_count','production_countries', 'runtime','release_date',],inplace=True)

In [8]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

In [9]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = df_basics['tconst'].fillna('').map(len).max()
title_len = df_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [10]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "" 
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
#create_database(connection)

In [31]:
engine = create_engine(connection)
engine.connect()

In [12]:
# Save to sql with dtype and index=False
df_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)
# Save to sql with dtype and index=False
genres_lookup.to_sql('genres_lookup',engine,dtype=df_schema,if_exists='replace',index=False)
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)
# Save to sql with dtype and index=False
df_tmdb.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

3078

In [18]:
sql = "SELECT * FROM tmdb_data LIMIT 5;"
pd.read_sql(sql, engine)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0116391         0.0         0.0          None
4  tt0118694    150000.0  14204632.0            PG

In [19]:
sql = "SELECT * FROM title_genres LIMIT 5;"
pd.read_sql(sql, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0068865         7

In [42]:
from sqlalchemy import text
with engine.connect() as conn:
   conn.execute(text('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);'))
   conn.execute(text('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`);'))
   conn.execute(text('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);'))

<sqlalchemy.engine.base.Connection at 0x18f14280a90>

In [41]:
sql = "SHOW TABLES;"
pd.read_sql(sql, engine)

  Tables_in_movies
0    genres_lookup
1     title_basics
2     title_genres
3        tmdb_data